sysbench_test_OpenGauss_High_Concurrency.log
========================================
Sysbench Test Parameters:
TABLES=50, TABLE_SIZE=100000, THREADS=100, TIME=600, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=50 --table-size=100000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 100000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 100000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 100000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 100000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 100000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 100000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 100000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 100000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 100000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 100000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
Creating table 'sbtest11'...
Inserting 100000 records into 'sbtest11'
Creating a secondary index on 'sbtest11'...
Creating table 'sbtest12'...
Inserting 100000 records into 'sbtest12'
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest13'...
Inserting 100000 records into 'sbtest13'
Creating a secondary index on 'sbtest13'...
Creating table 'sbtest14'...
Inserting 100000 records into 'sbtest14'
Creating a secondary index on 'sbtest14'...
Creating table 'sbtest15'...
Inserting 100000 records into 'sbtest15'
Creating a secondary index on 'sbtest15'...
Creating table 'sbtest16'...
Inserting 100000 records into 'sbtest16'
Creating a secondary index on 'sbtest16'...
Creating table 'sbtest17'...
Inserting 100000 records into 'sbtest17'
Creating a secondary index on 'sbtest17'...
Creating table 'sbtest18'...
Inserting 100000 records into 'sbtest18'
Creating a secondary index on 'sbtest18'...
Creating table 'sbtest19'...
Inserting 100000 records into 'sbtest19'
Creating a secondary index on 'sbtest19'...
Creating table 'sbtest20'...
Inserting 100000 records into 'sbtest20'
Creating a secondary index on 'sbtest20'...
Creating table 'sbtest21'...
Inserting 100000 records into 'sbtest21'
Creating a secondary index on 'sbtest21'...
Creating table 'sbtest22'...
Inserting 100000 records into 'sbtest22'
Creating a secondary index on 'sbtest22'...
Creating table 'sbtest23'...
Inserting 100000 records into 'sbtest23'
Creating a secondary index on 'sbtest23'...
Creating table 'sbtest24'...
Inserting 100000 records into 'sbtest24'
Creating a secondary index on 'sbtest24'...
Creating table 'sbtest25'...
Inserting 100000 records into 'sbtest25'
Creating a secondary index on 'sbtest25'...
Creating table 'sbtest26'...
Inserting 100000 records into 'sbtest26'
Creating a secondary index on 'sbtest26'...
Creating table 'sbtest27'...
Inserting 100000 records into 'sbtest27'
Creating a secondary index on 'sbtest27'...
Creating table 'sbtest28'...
Inserting 100000 records into 'sbtest28'
Creating a secondary index on 'sbtest28'...
Creating table 'sbtest29'...
Inserting 100000 records into 'sbtest29'
Creating a secondary index on 'sbtest29'...
Creating table 'sbtest30'...
Inserting 100000 records into 'sbtest30'
Creating a secondary index on 'sbtest30'...
Creating table 'sbtest31'...
Inserting 100000 records into 'sbtest31'
Creating a secondary index on 'sbtest31'...
Creating table 'sbtest32'...
Inserting 100000 records into 'sbtest32'
Creating a secondary index on 'sbtest32'...
Creating table 'sbtest33'...
Inserting 100000 records into 'sbtest33'
Creating a secondary index on 'sbtest33'...
Creating table 'sbtest34'...
Inserting 100000 records into 'sbtest34'
Creating a secondary index on 'sbtest34'...
Creating table 'sbtest35'...
Inserting 100000 records into 'sbtest35'
Creating a secondary index on 'sbtest35'...
Creating table 'sbtest36'...
Inserting 100000 records into 'sbtest36'
Creating a secondary index on 'sbtest36'...
Creating table 'sbtest37'...
Inserting 100000 records into 'sbtest37'
Creating a secondary index on 'sbtest37'...
Creating table 'sbtest38'...
Inserting 100000 records into 'sbtest38'
Creating a secondary index on 'sbtest38'...
Creating table 'sbtest39'...
Inserting 100000 records into 'sbtest39'
Creating a secondary index on 'sbtest39'...
Creating table 'sbtest40'...
Inserting 100000 records into 'sbtest40'
Creating a secondary index on 'sbtest40'...
Creating table 'sbtest41'...
Inserting 100000 records into 'sbtest41'
Creating a secondary index on 'sbtest41'...
Creating table 'sbtest42'...
Inserting 100000 records into 'sbtest42'
Creating a secondary index on 'sbtest42'...
Creating table 'sbtest43'...
Inserting 100000 records into 'sbtest43'
Creating a secondary index on 'sbtest43'...
Creating table 'sbtest44'...
Inserting 100000 records into 'sbtest44'
Creating a secondary index on 'sbtest44'...
Creating table 'sbtest45'...
Inserting 100000 records into 'sbtest45'
Creating a secondary index on 'sbtest45'...
Creating table 'sbtest46'...
Inserting 100000 records into 'sbtest46'
Creating a secondary index on 'sbtest46'...
Creating table 'sbtest47'...
Inserting 100000 records into 'sbtest47'
Creating a secondary index on 'sbtest47'...
Creating table 'sbtest48'...
Inserting 100000 records into 'sbtest48'
Creating a secondary index on 'sbtest48'...
Creating table 'sbtest49'...
Inserting 100000 records into 'sbtest49'
Creating a secondary index on 'sbtest49'...
Creating table 'sbtest50'...
Inserting 100000 records into 'sbtest50'
Creating a secondary index on 'sbtest50'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=50 --table-size=100000 --threads=100 --time=600 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 406.86 qps: 8267.23 (r/w/o: 5809.89/1633.43/823.91) lat (ms,95%): 475.79 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 100 tps: 423.90 qps: 8474.41 (r/w/o: 5931.54/1694.58/848.29) lat (ms,95%): 314.45 err/s: 0.20 reconn/s: 0.00
[ 30s ] thds: 100 tps: 414.21 qps: 8278.87 (r/w/o: 5793.79/1656.55/828.53) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 405.60 qps: 8113.61 (r/w/o: 5680.31/1621.80/811.50) lat (ms,95%): 331.91 err/s: 0.10 reconn/s: 0.00
[ 50s ] thds: 100 tps: 362.90 qps: 7267.24 (r/w/o: 5089.26/1451.89/726.09) lat (ms,95%): 390.30 err/s: 0.10 reconn/s: 0.00
[ 60s ] thds: 100 tps: 349.50 qps: 6982.79 (r/w/o: 4887.56/1396.02/699.21) lat (ms,95%): 363.18 err/s: 0.10 reconn/s: 0.00
[ 70s ] thds: 100 tps: 379.10 qps: 7591.07 (r/w/o: 5314.68/1518.19/758.20) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 100 tps: 354.20 qps: 7081.12 (r/w/o: 4954.82/1417.90/708.40) lat (ms,95%): 397.39 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 100 tps: 331.20 qps: 6620.96 (r/w/o: 4635.27/1323.19/662.50) lat (ms,95%): 450.77 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 100 tps: 306.90 qps: 6144.71 (r/w/o: 4301.91/1228.90/613.90) lat (ms,95%): 484.44 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 100 tps: 303.20 qps: 6068.76 (r/w/o: 4250.27/1211.79/606.70) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 100 tps: 314.80 qps: 6289.36 (r/w/o: 4400.44/1259.11/629.81) lat (ms,95%): 467.30 err/s: 0.10 reconn/s: 0.00
[ 130s ] thds: 100 tps: 310.30 qps: 6208.11 (r/w/o: 4345.01/1242.50/620.60) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 100 tps: 302.89 qps: 6048.79 (r/w/o: 4232.85/1210.16/605.78) lat (ms,95%): 493.24 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 296.61 qps: 5936.50 (r/w/o: 4157.54/1185.74/593.22) lat (ms,95%): 511.33 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 100 tps: 295.80 qps: 5918.41 (r/w/o: 4141.91/1184.90/591.60) lat (ms,95%): 511.33 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 100 tps: 291.10 qps: 5816.81 (r/w/o: 4072.71/1161.90/582.20) lat (ms,95%): 520.62 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 100 tps: 288.90 qps: 5787.40 (r/w/o: 4051.90/1157.70/577.80) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 100 tps: 284.40 qps: 5682.40 (r/w/o: 3978.50/1135.10/568.80) lat (ms,95%): 539.71 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 100 tps: 284.70 qps: 5693.80 (r/w/o: 3983.90/1140.40/569.50) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 100 tps: 280.90 qps: 5617.49 (r/w/o: 3934.09/1121.50/561.90) lat (ms,95%): 530.08 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 100 tps: 277.90 qps: 5559.87 (r/w/o: 3892.08/1111.79/556.00) lat (ms,95%): 559.50 err/s: 0.10 reconn/s: 0.00
[ 230s ] thds: 100 tps: 278.70 qps: 5572.25 (r/w/o: 3899.43/1115.41/557.40) lat (ms,95%): 549.52 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 100 tps: 263.30 qps: 5264.00 (r/w/o: 3684.70/1052.60/526.70) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 100 tps: 260.10 qps: 5211.38 (r/w/o: 3649.79/1041.30/520.30) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 259.20 qps: 5178.31 (r/w/o: 3624.54/1035.38/518.39) lat (ms,95%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 100 tps: 255.90 qps: 5124.67 (r/w/o: 3586.45/1026.41/511.81) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 100 tps: 237.80 qps: 4753.60 (r/w/o: 3326.50/951.30/475.80) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 100 tps: 248.70 qps: 4974.62 (r/w/o: 3484.51/992.70/497.40) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 100 tps: 242.30 qps: 4844.99 (r/w/o: 3390.49/969.90/484.60) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 100 tps: 243.90 qps: 4883.30 (r/w/o: 3419.60/975.70/488.00) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 100 tps: 236.79 qps: 4724.06 (r/w/o: 3304.30/946.17/473.59) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 100 tps: 244.51 qps: 4890.05 (r/w/o: 3424.50/976.33/489.21) lat (ms,95%): 559.50 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 100 tps: 261.40 qps: 5235.81 (r/w/o: 3666.01/1047.00/522.80) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 100 tps: 247.80 qps: 4952.19 (r/w/o: 3464.99/991.50/495.70) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 100 tps: 229.80 qps: 4596.08 (r/w/o: 3217.79/918.70/459.60) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 100 tps: 229.50 qps: 4595.33 (r/w/o: 3218.72/917.61/459.00) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 100 tps: 227.40 qps: 4546.01 (r/w/o: 3180.90/910.30/454.80) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 100 tps: 225.20 qps: 4498.19 (r/w/o: 3147.39/900.40/450.40) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 100 tps: 242.80 qps: 4867.80 (r/w/o: 3408.80/973.30/485.70) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 100 tps: 228.90 qps: 4569.49 (r/w/o: 3198.29/913.40/457.80) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 100 tps: 220.40 qps: 4407.50 (r/w/o: 3085.30/881.40/440.80) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 100 tps: 233.60 qps: 4669.00 (r/w/o: 3268.00/933.80/467.20) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 100 tps: 221.70 qps: 4438.82 (r/w/o: 3106.41/889.00/443.40) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 100 tps: 247.20 qps: 4940.68 (r/w/o: 3458.58/987.70/494.40) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 100 tps: 223.20 qps: 4467.20 (r/w/o: 3127.30/893.40/446.50) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 100 tps: 221.00 qps: 4420.88 (r/w/o: 3095.79/883.10/442.00) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 100 tps: 224.40 qps: 4489.53 (r/w/o: 3143.82/896.91/448.80) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 100 tps: 222.10 qps: 4439.58 (r/w/o: 3106.48/888.90/444.20) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 100 tps: 247.20 qps: 4945.32 (r/w/o: 3461.92/989.00/494.40) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 100 tps: 220.70 qps: 4410.69 (r/w/o: 3087.09/882.00/441.60) lat (ms,95%): 746.32 err/s: 0.10 reconn/s: 0.00
[ 520s ] thds: 100 tps: 213.60 qps: 4273.00 (r/w/o: 2991.00/854.80/427.20) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 100 tps: 198.00 qps: 3964.50 (r/w/o: 2775.00/793.50/396.00) lat (ms,95%): 1013.60 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 100 tps: 223.50 qps: 4465.11 (r/w/o: 3125.51/892.40/447.20) lat (ms,95%): 657.93 err/s: 0.10 reconn/s: 0.00
[ 550s ] thds: 100 tps: 206.90 qps: 4141.63 (r/w/o: 2899.05/828.79/413.79) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 100 tps: 206.80 qps: 4140.77 (r/w/o: 2900.25/826.91/413.61) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 100 tps: 201.20 qps: 4017.09 (r/w/o: 2809.50/805.10/402.50) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 100 tps: 216.30 qps: 4328.22 (r/w/o: 3031.81/863.80/432.60) lat (ms,95%): 707.07 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 100 tps: 204.80 qps: 4101.79 (r/w/o: 2871.00/821.20/409.60) lat (ms,95%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 100 tps: 201.10 qps: 4019.79 (r/w/o: 2811.89/805.50/402.40) lat (ms,95%): 909.80 err/s: 0.10 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2253244
        write:                           643739
        other:                           321917
        total:                           3218900
    transactions:                        160936 (268.09 per sec.)
    queries:                             3218900 (5362.05 per sec.)
    ignored errors:                      10     (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.3108s
    total number of events:              160936

Latency (ms):
         min:                                 13.88
         avg:                                372.92
         max:                               2005.97
         95th percentile:                    646.19
         sum:                            60016747.29

Threads fairness:
    events (avg/stddev):           1609.3600/11.87
    execution time (avg/stddev):   600.1675/0.10

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=172.17.0.2 --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Opengauss@2022 --pgsql-db=sbtest --tables=50 --table-size=100000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...
Dropping table 'sbtest21'...
Dropping table 'sbtest22'...
Dropping table 'sbtest23'...
Dropping table 'sbtest24'...
Dropping table 'sbtest25'...
Dropping table 'sbtest26'...
Dropping table 'sbtest27'...
Dropping table 'sbtest28'...
Dropping table 'sbtest29'...
Dropping table 'sbtest30'...
Dropping table 'sbtest31'...
Dropping table 'sbtest32'...
Dropping table 'sbtest33'...
Dropping table 'sbtest34'...
Dropping table 'sbtest35'...
Dropping table 'sbtest36'...
Dropping table 'sbtest37'...
Dropping table 'sbtest38'...
Dropping table 'sbtest39'...
Dropping table 'sbtest40'...
Dropping table 'sbtest41'...
Dropping table 'sbtest42'...
Dropping table 'sbtest43'...
Dropping table 'sbtest44'...
Dropping table 'sbtest45'...
Dropping table 'sbtest46'...
Dropping table 'sbtest47'...
Dropping table 'sbtest48'...
Dropping table 'sbtest49'...
Dropping table 'sbtest50'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241220_131611.log